app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Well "], ["room_number", 102]]

    def update
        set_school_class
        @school_class = SchoolClass.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 1022], ["id", 4]]

    def set_school_class
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]