app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "User1"], ["updated_at", "2020-03-02 00:24:15.405733"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)